# Brewfile
# Install with: brew bundle
# Docs: https://github.com/Homebrew/homebrew-bundle

# --- Taps ---
tap "514-labs/tap"
tap "UpCloudLtd/tap"
tap "derailed/k9s"
tap "dotenvx/brew"
tap "emqx/mqttx"
tap "entireio/tap"
tap "hashicorp/tap"
tap "minio/stable"
tap "nubjs/tap"
tap "probe-rs/probe-rs"
tap "tinygo-org/tools"

# --- Formulas ---
brew "age"
brew "biome"
brew "brotli"
brew "colima"
brew "cosign"
brew "crane"
brew "dnsglobe"             # https://github.com/514-labs/dnsglobe
brew "dotenvx"
brew "ffmpeg"
brew "flyctl"
brew "goat"
brew "gh" # https://cli.github.com
brew "helm"
brew "htop"
brew "httpstat"
brew "hugo"
brew "hurl"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "libpq"
brew "llama.cpp"
brew "mactop"
brew "mc"                   # MinIO client (minio/stable)
brew "minijinja-cli"
brew "mqttx-cli"            # EMQX
brew "nub"                  # https://github.com/nubjs/nub
brew "opentofu"
brew "ouch"
brew "pkl"
brew "probe-rs"             # Rust probe-rs
brew "pyenv"
brew "rage"
brew "restic"
brew "rsync"
brew "ruby"
brew "scw"
brew "sops"
brew "terraform"            # hashicorp/tap
brew "tinygo"
brew "upcloud-cli"          # UpCloud CLI
brew "valkey"
brew "yq"

# --- Casks ---
cask "1password-cli"
cask "git-sync"             # https://github.com/entireio/git-sync
cask "miniconda"

# --- Disabled ---
# cask "syncthing-app"      # https://formulae.brew.sh/cask/syncthing-app
# brew "ghostty"            # reinstall with `brew reinstall --overwrite ghostty`
