# Brewfile
# Install with: brew bundle
# Docs: https://docs.brew.sh/Brew-Bundle-and-Brewfile

# --- Taps ---
# Homebrew 6+ requires explicit trust for non-official taps before loading their Ruby.
tap "514-labs/tap", trusted: true
tap "UpCloudLtd/tap", trusted: true
tap "derailed/k9s", trusted: true
tap "dotenvx/brew", trusted: true
tap "emqx/mqttx", trusted: true
tap "entireio/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "minio/stable", trusted: true
tap "nubjs/tap", trusted: true
tap "probe-rs/probe-rs", trusted: true
tap "rjyo/moshi", trusted: true
tap "tinygo-org/tools", trusted: true

# --- Formulas ---
brew "age"
brew "biome"
brew "brotli"
brew "colima"
brew "cosign"
brew "crane"
brew "dnsglobe" # https://github.com/514-labs/dnsglobe
brew "dotenvx"
brew "ffmpeg"
brew "flyctl"
brew "goat"
brew "gh" # https://cli.github.com
brew "herdr" # https://herdr.dev
brew "helm"
brew "htop"
brew "httpstat"
brew "hugo"
brew "huggingface-cli"
brew "hurl"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "libpq"
brew "llama.cpp"
brew "mactop"
brew "mc" # MinIO client (minio/stable)
brew "minijinja-cli"
brew "moshi-hook" # https://getmoshi.app/docs/hooks
brew "mqttx-cli" # EMQX
brew "nub" # https://github.com/nubjs/nub
brew "opentofu"
brew "ouch"
brew "pkl"
brew "probe-rs" # Rust probe-rs
brew "pyenv"
brew "rage"
brew "restic"
brew "rsync"
brew "ruby"
brew "scw"
brew "sops"
brew "terraform" # hashicorp/tap
brew "tinygo"
brew "upcloud-cli" # UpCloud CLI
brew "valkey"
brew "yq"

# --- Casks ---
cask "1password-cli"
cask "git-sync" # https://github.com/entireio/git-sync
# cask "miniconda"

# --- Disabled ---
# cask "syncthing-app"
# brew "ghostty"
